In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
df = pd.read_csv('customer_data.csv')
df

,CustomerID,Name,Age,Gender,Income,JoinDate,Country,Feedback
0,1,John Doe,28.0,Male,50000.0,2021-06-15,USA,Good service
1,2,Jane Smith,NaN,Female,62000.0,2019-03-22,Canada,Excellent!
2,3,Bob Johnson,45.0,NaN,48000.0,2020-11-05,USA,Average
3,4,Alice Brown,35.0,Female,NaN,2021-02-17,UK,Poor service
4,5,Tom White,52.0,Male,70000.0,2018-07-30,NaN,Great
5,6,Lisa Green,23.0,Female,52000.0,2022-01-12,USA,NaN
6,7,Michael Black,40.0,Male,0.0,2020-04-10,Canada,Excellent!
7,8,Susan Blue,30.0,Female,58000.0,NaN,USA,Good service

In [3]:
df.isna()

   CustomerID   Name    Age  Gender  Income  JoinDate  Country  Feedback
0       False  False  False   False   False     False    False     False
1       False  False   True   False   False     False    False     False
2       False  False  False    True   False     False    False     False
3       False  False  False   False    True     False    False     False
4       False  False  False   False   False     False     True     False
5       False  False  False   False   False     False    False      True
6       False  False  False   False   False     False    False     False
7       False  False  False   False   False      True    False     False

In [5]:
df = df.fillna(0)
df

,CustomerID,Name,Age,Gender,Income,JoinDate,Country,Feedback
0,1,John Doe,28.0,Male,50000.0,2021-06-15,USA,Good service
1,2,Jane Smith,0.0,Female,62000.0,2019-03-22,Canada,Excellent!
2,3,Bob Johnson,45.0,0,48000.0,2020-11-05,USA,Average
3,4,Alice Brown,35.0,Female,0.0,2021-02-17,UK,Poor service
4,5,Tom White,52.0,Male,70000.0,2018-07-30,0,Great
5,6,Lisa Green,23.0,Female,52000.0,2022-01-12,USA,0
6,7,Michael Black,40.0,Male,0.0,2020-04-10,Canada,Excellent!
7,8,Susan Blue,30.0,Female,58000.0,0,USA,Good service